Tekla Open API Reference for Tekla Structures 2025
UserPropertyItem.SetOptions Method
Overload List
Name | Description
SetOptions(List<KeyValuePair<Double, String>>)
 Sets the value options of a double property. The maximum count of options is 400.
SetOptions(List<KeyValuePair<Int32, String>>)
 Sets the value options of an integer property. The maximum count of options is 400.
SetOptions(List<KeyValuePair<String, String>>)
 Sets the value options of a string property. The maximum count of options is 400.
Top
See Also
Reference
UserPropertyItem Class
Tekla.Structures.Catalogs Namespace